[
    {
        "title": "Pix2Pix",
        "year": "2025",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "I implemented pix2pix and tried to generate the comic book character from the real photo. I like to read comic books and have dreamed of myself becoming a character some day. And the time comes. If we use the pix2pix, I can make my dream comes true. Thus I tried to make comic book character from the real photo by using pix2pix. At first I tuned my pix2pix model by using Facades dataset, which is used in original paper. After that I tried to make myself a comic books character. Though the output was somewhat blurred, I could change my photo like a comic book character.(https://ryotakemuraryo.github.io/pix2pix/)"
    },
    {
        "title": "Mahjong AI",
        "year": "2025",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "Is it possible to design an AI algorithm that behaves similar to human players ranging from beginning to master for the simple-styled Shanghai mahjong? The data used represents training data by simulations and measures the skill expression of our agent given a starting hand. Our environment is used to guide the AI algorithm how to behave as an agent with a goal to win but with differentiating skill levels.(https://ryotakemuraryo.github.io/MahjongAI/)"
    },
    {
        "title": "Persuasive or Deceptive Visualization?",
        "year": "2025",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "I designed two visualizations to persuade a reader about each side of the proposition; one is on the side and the other is against the side!(https://ryotakemuraryo.github.io/Assignment2/)"
    },
    {
        "title": "Visited Palm Springs Windmills",
        "year": "2025",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "I visited Palm Springs, which is famous for many windmills. I joined a tour and learn the history of windmills and how engineers tackled a lot of difficulties and reached to a success."
    },
    {
        "title": "Start studying abroad in University of California San Diego.",
        "year": "2024",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "I start stuydying abroad at University of California San Diego from this september to June 2025. I'll mainly study energy engineering and computer science!"
    },
    {
        "title": "Went to China as a delegation",
        "year": "2023",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "I went to China as a delegation for cultivating the friendship between Japan and China. I could learn a lot of Chinese culture and discuss some social and environmental problems with Beijing University students."
    },
    {
        "title": "Joined Human Space Development Camp in Kyoto University.",
        "year": "2021",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "I joined Human Space Development Camp, which is a special class offered by Kyoto University. I could think about how we can live in the space in the future with a former astronaut Takao Doi. During one week camp, I could find a lot of possibilities to live in space."
    }
]